InformationRegisters/NVA_ИсторияЗаявкиНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>NVA_ИсторияЗаявкиНаДоставку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/NVA_ИсторияЗаявкиНаДоставку/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьВИсторию(Заявка, Дата, Пользователь, Комментарий) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.NVA_ИсторияЗаявкиНаДоставку.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаявкаНаДоставку = Заявка;
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.Пользователь = Пользователь;	
	МенеджерЗаписи.Комментарий 	= Комментарий;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
